#Задача 1

#Тема: Оператор if

#Напишите программу, которая принимает от пользователя число. Если это число положительное, выведите сообщение: "Число положительное".

#(Для простоты можно считать ноль положительным числом).

number = int(input())
if number > 0:
    print("Число положительное")
#Отлично! Задача решена правильно.

#Ваш код:

#Корректно получает число от пользователя.

#Правильно использует оператор if с условием number > 0 для проверки положительности числа.

#Выводит верное сообщение, когда условие выполняется.

#Задача 1 завершена. Готовы к следующей задаче?

#Задача 2

#Тема: Оператор else

#Напишите программу, которая запрашивает у пользователя целое число. Если число четное, выведите сообщение "Число четное". В противном случае выведите сообщение "Число нечетное".

number = int(input())
if number % 2 == 0:
    print("Число четное")
else:
    print("Число нечетное")
#Идеально! Задача решена верно.

#Ваш код:

#Правильно определяет четность числа с помощью проверки остатка от деления на 2.

#Точно использует блок if для четного случая и блок else для всех остальных (нечетных) случаев.

#Выводит корректные сообщения в зависимости от результата.

#Задача 2 завершена. Готовы к следующей задаче?

#Задача 3

#Тема: Логические операции

#Напишите программу, которая принимает от пользователя целое число. Если число находится в диапазоне от 10 до 20 (включительно), выведите сообщение "Число в диапазоне". В противном случае ничего выводить не нужно.

number = int(input())
if number >= 10 and number <=20:
    print("Число в диапазоне")
#Превосходно! Задача решена правильно.

#Ваш код:

#Корректно использует логическую операцию and для проверки, что число одновременно больше или равно 10 И меньше или равно 20.

#Точно определяет диапазон включительно.

#Выводит сообщение только когда условие выполняется.

#Задача 3 завершена. Готовы к следующей задаче?

#Задача 4

#Тема: Оператор elif

#Напишите программу, которая запрашивает у пользователя оценку (целое число от 1 до 5).

#Если оценка 5, выведите "Отлично"

#Если оценка 4, выведите "Хорошо"

#Если оценка 3, выведите "Удовлетворительно"

#Если оценка 2 или 1, выведите "Неудовлетворительно"

number = int(input())
if number == 5:
    print("Отлично")
elif number == 4:
    print("Хорошо")
elif number == 3:
    print("Удовлетворительно")
else:
    print("Неудовлетворительно")
#Отлично! Задача решена верно.

#Ваш код:

#Правильно использует цепочку операторов if-elif-else для обработки различных случаев.

#Точно проверяет каждое значение оценки от 5 до 3.

#Корректно обрабатывает оставшиеся случаи (2 и 1) в блоке else.

#Задача 4 завершена. Готовы к следующей задаче?

#Задача 5

#Тема: Тернарный оператор

#Напишите программу, которая принимает от пользователя число. Используя тернарный оператор, присвойте переменной result строку "Четное", если число четное, и "Нечетное", если число нечетное. Затем выведите значение переменной result.

number = int(input())
result = "Четное" if number % 2 == 0 else "нечетное"
print(result)
#Почти идеально! Обратите внимание на регистр в строке "нечетное". В условии задачи требуется выводить "Нечетное" (с заглавной буквы), а у вас выводится "нечетное" (со строчной).

#Исправьте регистр в строке для нечетного случая, и задача будет решена полностью верно.

number = int(input())
result = "Четное" if number % 2 == 0 else "Нечетное"
print(result)
#Великолепно! Теперь задача решена полностью правильно.

#Ваш код:

#Корректно использует тернарный оператор для присвоения значения переменной result.

#Правильно проверяет четность числа через условие number % 2 == 0.

#Выводит значения с правильным регистром: "Четное" и "Нечетное".

#Задача 5 завершена. Готовы к следующей задаче?

#Задача 6

#Тема: Логические операции в условиях

#Напишите программу, которая принимает от пользователя возраст (целое число). Если возраст меньше 0 или больше 120, выведите сообщение "Некорректный возраст". В противном случае ничего выводить не нужно.

age = int(input())
if age < 0 or age > 120:
    print("Некорректный возраст")
#Безупречно! Задача решена абсолютно верно.

#Ваш код:

#Правильно использует логическую операцию or для проверки, что возраст либо меньше 0, либо больше 120.

#Точно определяет некорректный возраст в обоих крайних случаях.

#Выводит сообщение только когда условие выполняется.

#Задача 6 завершена. Вы успешно закрепили все основные разделы темы условных операторов!

#Задача 7

#Тема: Комбинированная задача (if-elif-else + логические операции)

#Напишите программу, которая запрашивает у пользователя год (целое число). Программа должна определить, является ли год високосным, и вывести соответствующее сообщение:

#Если год делится на 4, но не делится на 100, то он високосный

#Если год делится на 400, то он високосный

#Во всех остальных случаях год не високосный

#Выведите "Високосный год" или "Не високосный год".

year = int(input())
if year % 4 == 0 and year % 100 != 0:
    print("Високосный год")
elif year % 400 == 0:
    print("Високосный год")
else:
    print("Не високосный год")

#Идеально! Теперь задача решена полностью правильно.

#Ваш код:

#Правильно использует оператор остатка от деления % для проверки делимости

#Точно реализует правило високосного года:

#Делится на 4 И не делится на 100

#ИЛИ делится на 400

#Корректно использует цепочку if-elif-else для охвата всех случаев

#Задача 7 завершена. Продолжаем практику с более сложными комбинированными задачами?

#Задача 8

#Тема: Комбинированная задача (вложенные условия + логические операции)

#Напишите программу, которая запрашивает у пользователя три числа. Выведите сообщение "Все числа равны", если все три числа одинаковы. Если хотя бы два числа равны, выведите "Два числа равны". Если все числа разные, выведите "Все числа разные".

num1 = int(input())
num2 = int(input())
num3 = int(input())
if num1 == num2 == num3:
    print("Все числа равны")
elif (num1 == num2 != num3) or (num1 != num2 == num3) or (num1 == num3 != num2):
    print("Два числа равны")
else:
    print("Все числа разные")
#Проверьте логику в блоке elif. Вы перечислили все возможные комбинации равенства двух чисел, но условие можно упростить.

#Подумайте: если не выполнилось условие, что все три числа равны, и при этом хотя бы одна пара чисел равна - это как раз случай "Два числа равны".

#Проверьте, что ваш текущий код выводит правильные сообщения для всех возможных комбинаций:

#5, 5, 5

#5, 5, 3

#5, 3, 5

#3, 5, 5

#1, 2, 3

num1 = int(input())
num2 = int(input())
num3 = int(input())
if num1 == num2 == num3:
    print("Все числа равны")
elif (num1 == num2 != num3) or (num1 != num2 == num3) :
    print("Два числа равны")
else:
    print("Все числа разные")
#Проверьте, все ли случаи равенства двух чисел вы учли. В вашем текущем условии не хватает одной возможной комбинации, когда равны первое и третье число, но второе отличается.

#Протестируйте ваш код на примере: num1 = 5, num2 = 3, num3 = 5
#В этом случае два числа равны (первое и третье), но ваша программа может не вывести правильное сообщение.

#Добавьте недостающую комбинацию в условие.

num1 = int(input())
num2 = int(input())
num3 = int(input())
if num1 == num2 == num3:
    print("Все числа равны")
elif (num1 == num2 != num3) or (num1 != num2 == num3) or (num1 == num3 != num2):
    print("Два числа равны")
else:
    print("Все числа разные")
#Отлично! Теперь задача решена полностью правильно.

#Ваш код:

#Правильно обрабатывает все три случая:

#Все три числа равны

#Равны ровно два числа (все три возможные комбинации)

#Все числа разные

#Точно использует комбинации сравнений для выявления равенства двух чисел

#Логика условий охватывает все возможные сценарии

#Задача 8 завершена. Продолжаем практику?

#Задача 9

#Тема: Комбинированная задача (тернарный оператор + логические операции)

#Напишите программу, которая принимает от пользователя два числа. Используя тернарный оператор, присвойте переменной max_number значение большего из двух чисел. Если числа равны, присвойте значение "Числа равны". Затем выведите значение переменной max_number.

num1 = int(input())
num2 = int(input())
max_number = num1 if num1 > num2 elif num2 if num2 > num1 else ("Числа равны")
    print(max_number)
#В тернарном операторе есть синтаксическая ошибка. Тернарный оператор в Python имеет формат:

#переменная = значение_если_истина if условие else значение_если_ложь

#Для нескольких условий нужно использовать вложенные тернарные операторы или другой подход.

#Перепишите присваивание переменной max_number, используя правильный синтаксис тернарного оператора. Вам нужно сравнить два числа и выбрать подходящее значение.

num1 = int(input())
num2 = int(input())
max_number = num1 if num1 > num2 or num2 if num2 > num1 else ("Числа равны")
    print(max_number)
#Синтаксис тернарного оператора все еще неверный. Вы не можете использовать конструкцию if-elif или несколько условий через or в одном тернарном операторе.

#Попробуйте другой подход: используйте вложенные тернарные операторы. Структура должна быть такой:

#переменная = значение1 if условие1 else (значение2 if условие2 else значение3)

#Подумайте, как можно сравнить сначала, равно ли первое число второму, а затем уже определить, какое число больше.

num1 = int(input())
num2 = int(input())
max_number = num1 if num1 > num2 else( num2 if num2 > num1 else ("Числа равны"))
    print(max_number)
#Отлично! Теперь синтаксис тернарного оператора абсолютно верный.

#Ваш код:

#Правильно использует вложенный тернарный оператор

#Сначала проверяет, больше ли первое число

#Если нет, проверяет, больше ли второе число

#Если и это не true, присваивает "Числа равны"

#Корректно выводит результат

#Задача 9 завершена. Вы успешно справились с комбинированными задачами!

#Задача 10

#Тема: Комбинированная задача (множественные условия + приоритет операций)

#Напишите программу, которая запрашивает у пользователя температуру (целое число) и тип шкалы: C (Цельсий) или F (Фаренгейт).

#Если шкала C и температура меньше или равна 0, выведите "Лед"

#Если шкала C и температура между 1 и 100, выведите "Вода"

#Если шкала C и температура больше 100, выведите "Пар"

#Если шкала F и температура меньше или равна 32, выведите "Лед"

#Если шкала F и температура между 33 и 212, выведите "Вода"

#Если шкала F и температура больше 212, выведите "Пар"

temp = int(input())
scale = input("C") or input("F")
if scale = "C" and temp <=0:
    print("Лед")
elif scale = "C" and (temp >=1 and temp <= 100):
    print("Вода")
elif scale = "C" and temp > 100:
    print("Пар")
elif scale = "F" and temp <=32:
    print("Лед")
elif scale = "F" and (temp >= 33 and temp <= 212):
    print("Вода")
elif scale = "F" and temp > 212:
    print("Пар")
#В коде есть несколько синтаксических ошибок, которые нужно исправить:

#Оператор сравнения: Вы используете = (присваивание) вместо == (сравнение) в условиях. В условиях нужно использовать оператор сравнения ==.

#Ввод данных: Строка scale = input("C") or input("F") работает не так, как вы ожидаете. Нужно просто запросить ввод один раз, например: scale = input("Введите шкалу (C/F): ")

#Лишние скобки: В условиях с диапазонами можно упростить проверки.

#Исправьте эти моменты, и программа будет работать правильно.

temp = int(input())
scale = input("Введите шкалу (C/F): ")
if scale == "C" and temp <=0:
    print("Лед")
elif scale == "C" and (temp >=1 and temp <= 100):
    print("Вода")
elif scale == "C" and temp > 100:
    print("Пар")
elif scale == "F" and temp <=32:
    print("Лед")
elif scale == "F" and (temp >= 33 and temp <= 212):
    print("Вода")
elif scale == "F" and temp > 212:
    print("Пар")
#Отлично! Теперь задача решена полностью правильно.

#Ваш код:

#Правильно использует оператор сравнения == вместо присваивания

#Корректно запрашивает шкалу измерения

#Точно проверяет все условия для обеих шкал (Цельсий и Фаренгейт)

#Правильно определяет состояние вещества (лед, вода, пар) в зависимости от температуры и шкалы

#Задача 10 завершена. Продолжаем практику с комбинированными задачами?