#Задача 1

#Создай список с названиями трех твоих любимых фруктов.

#Напиши код, который создает этот список и выводит его.

fruits = ["малина", "калина", "арбуз"]
print(fruits)
#Правильно! Задача решена верно.

#Разбор:

#Список создан с помощью квадратных скобок [].

#Элементы списка - строки, заключенные в кавычки.

#Список выведен на экран с помощью функции print().

#Готовы к следующей задаче по спискам? Напишите "Давай задачу".

#Давай задачу
#Задача 2

#Дан список: numbers = [10, 20, 30, 40, 50]

#Получи второй элемент этого списка (с индексом 1) и выведи его.

numbers = [10, 20, 30, 40, 50]
print(numbers[1])
#Правильно! Задача решена верно.

#Разбор:

#Использован индекс [1] для доступа ко второму элементу списка (индексация начинается с 0).

#Элемент 20 был выведен на экран.

#Готовы к следующей задаче? Напишите "Давай задачу".

#Давай задачу
#Задача 3

#Дан список: animals = ["cat", "dog", "hamster"]

#Добавь в конец этого списка строку "parrot" с помощью соответствующего метода.

#Напиши код, который выполняет добавление и выводит измененный список.

animals = ["cat", "dog", "hamster"]
print(animals.append("parrot"))
#Почти! Логика верная — метод .append() действительно используется для добавления элементов в конец списка.

#Что нужно сделать:
#Метод .append() изменяет исходный список, но не возвращает новый список для печати. Поэтому, если ты попытаешься сразу напечатать результат его работы, ты получишь None.

#Нужно сначала применить метод к списку, а затем отдельной командой вывести уже измененный список.

animals = ["cat", "dog", "hamster"]
all_animals = animals.append("parrot")
print(all_animals)
#Почти! Логика добавления элемента верная, но есть нюанс с тем, как работает метод .append().

#Что нужно сделать:
#Метод .append() изменяет исходный список animals "на месте" и возвращает None. Не нужно его результат присваивать новой переменной.

#Просто примени метод к списку, а затем выведи на печать сам исходный список animals — он уже будет изменен.

animals = ["cat", "dog", "hamster"]
animals.append("parrot")
print(animals)
#Правильно! Теперь задача решена верно.

#Разбор:

#Метод .append("parrot") добавил элемент в конец списка animals.

#После изменения списка выведен его новый состав: ['cat', 'dog', 'hamster', 'parrot'].

#Готовы к следующей задаче? Напишите "Давай задачу".

#Давай задачу
#Задача 4

#Дан список: colors = ["red", "blue", "green"]

#Используя срезы, получи из этого списка подсписок ["red", "blue"].

#Напиши код, который выведет этот результат.

colors = ["red", "blue", "green"]
print(colors[:2])
#Правильно! Задача решена верно.

#Разбор:

#Срез [:2] взял элементы от начала списка до индекса 2 (не включая его).

#Результат ['red', 'blue'] был выведен на экран.

#Готовы к следующей задаче? Напишите "Давай задачу".

#Давай задачу
#Задача 5

#Дан список: letters = ["a", "b", "d"]

#Добавь элемент "c" в список между "b" и "d" (на позицию с индексом 2).

#Напиши код, который выполняет добавление и выводит измененный список.

letters = ["a", "b", "d"]
print(letters.insert(2,"c"))
#Почти! Логика верная — метод .insert() действительно используется для вставки элемента на конкретную позицию.

#Что нужно сделать:
#Метод .insert(), как и .append(), изменяет исходный список, но не возвращает новый список для печати. Поэтому, если ты попытаешься сразу напечатать результат его работы, ты получишь None.

#Нужно сначала применить метод к списку, а затем отдельной командой вывести уже измененный список.

letters = ["a", "b", "d"]
letters.insert(2,"c")
print(letters)
#Правильно! Теперь задача решена верно.

#Разбор:

#Метод .insert(2, "c") вставил элемент "c" на позицию с индексом 2.

#После изменения список имеет вид: ['a', 'b', 'c', 'd'].

#Измененный список выведен на экран.

#Готовы к следующей задаче? Напишите "Давай задачу".

#Давай задачу
#Задача 6

#Дан список: items = [1, 2, 3, 4, 5]

#Удали последний элемент из этого списка с помощью соответствующего метода.

#Напиши код, который выполняет удаление и выводит измененный список.

items = [1, 2, 3, 4, 5]
items.pop()
print(items)
#Правильно! Задача решена верно.

#Разбор:

#Метод .pop() без аргументов удалил последний элемент списка.

#После изменения список имеет вид: [1, 2, 3, 4].

#Измененный список выведен на экран.

#Готовы к следующей задаче? Напишите "Давай задачу".

#Давай задачу
#Задача 7

#Даны два списка: list1 = [1, 2, 3] и list2 = [4, 5, 6]

#Объедини (слей) эти два списка в один с помощью оператора + и выведи результат.

list1 = [1, 2, 3]
list2 = [4, 5, 6]
list = list1 + list2
print(list)
#Правильно! Задача решена верно.

#Разбор:

#С помощью оператора + два списка объединены в один.

#Результат [1, 2, 3, 4, 5, 6] выведен на экран.

#Готовы к следующей задаче? Напишите "Давай задачу".

#Давай задачу
#Задача 8

#Дан список: fruits = ["apple", "banana", "cherry", "date"]

#Замени элемент "banana" (с индексом 1) на "orange".

#Напиши код, который выполняет замену и выводит измененный список.

fruits = ["apple", "banana", "cherry", "date"]
fruits[1] = "orange"
print(fruits)
#Правильно! Задача решена верно.

#Разбор:

#С помощью операции присваивания fruits[1] = "orange" элемент с индексом 1 был заменен.

#После изменения список имеет вид: ['apple', 'orange', 'cherry', 'date'].

#Измененный список выведен на экран.

#Готовы к следующей задаче? Напишите "Давай задачу".

#Давай задачу
#Задача 9

#Дан список: numbers = [5, 10, 15, 20, 25]

#Получи последний элемент этого списка, используя отрицательную индексацию.

#Напиши код, который выводит этот элемент.

numbers = [5, 10, 15, 20, 25]
print(numbers[-1])
#Правильно! Задача решена верно.

#Разбор:

#Использована отрицательная индексация [-1] для доступа к последнему элементу списка.

#Элемент 25 был выведен на экран.

#Готовы к следующей задаче? Напишите "Давай задачу".

#Давай задачу"
#Задача 10

#Создай пустой список с именем shopping_list.

#Напиши код, который создает этот список и выводит его.

shopping_list = []
print(shopping_list)
#Правильно! Задача решена верно.

#Разбор:

#Пустой список создан с помощью пустых квадратных скобок [].

#Список [] выведен на экран.

#Готовы к следующей задаче? Напишите "Давай задачу".

#Давай задачу

#Задача 11

#Дан список: items = ["book", "pen", "pencil", "eraser"]

#Удали элемент "pencil" из этого списка с помощью метода, который удаляет элемент по его значению.

#Напиши код, который выполняет удаление и выводит измененный список.

items = ["book", "pen", "pencil", "eraser"]
items.pop(2)
print(items)
#Почти! Метод .pop() с индексом действительно удаляет элемент, но в задании требуется использовать метод, который удаляет элемент по его значению, а не по индексу.

#Что нужно сделать:
#Вместо .pop(2) используй другой метод, который принимает в качестве аргумента само значение элемента ("pencil"), которое нужно удалить из списка.

items = ["book", "pen", "pencil", "eraser"]
items.remove("pencil")
print(items)
#Правильно! Теперь задача решена верно.

#Разбор:

#Метод .remove("pencil") нашел и удалил первый элемент в списке с таким значением.

#После изменения список имеет вид: ['book', 'pen', 'eraser'].

#Измененный список выведен на экран.

#Готовы к следующей задаче? Напишите "Давай задачу".

#Давай задачу
#Задача 12

#Дан список: numbers = [100, 200, 300, 400, 500]

#Используя срезы, получи из этого списка подсписок [300, 400, 500].

#Напиши код, который выведет этот результат.

numbers = [100, 200, 300, 400, 500]
print(numbers[2:5])
#Правильно! Задача решена верно.

#Разбор:

#Срез [2:5] взял элементы от индекса 2 до индекса 5 (не включая его).

#Результат [300, 400, 500] был выведен на экран.

#Готовы к следующей задаче? Напишите "Давай задачу".

#Давай задачу
#Задача 13

#Дан список: data = [10, 20, 30]

#Добавь число 40 в конец этого списка с помощью соответствующего метода.

#Напиши код, который выполняет добавление и выводит измененный список.

data = [10, 20, 30]
data.append(40)
print(data)
#Правильно! Задача решена верно.

#Разбор:

#Метод .append(40) добавил элемент в конец списка data.

#После изменения список имеет вид: [10, 20, 30, 40].

#Измененный список выведен на экран.

#Готовы к следующей задаче? Напишите "Давай задачу".

#Давай задачу
#Задача 14

#Дан список: letters = ["x", "y", "z"]

#Очисти этот список полностью, удалив все его элементы, с помощью соответствующего метода.

#Напиши код, который выполняет очистку и выводит измененный список.

letters = ["x", "y", "z"]
letters.clear()
print(letters)
#Правильно! Задача решена верно.

#Разбор:

#Метод .clear() удалил все элементы из списка.

#После изменения список стал пустым: [].

#Измененный список выведен на экран.

#На этом мы завершаем цикл задач по спискам. Вы успешно отработали все основные разделы: создание, доступ к элементам, добавление, вставку, замену, удаление, срезы и слияние списков. Если захотите продолжить практику, просто скажите "Давай задачу"!

#Давай задачу
#Задача 15

#Дан список: mixed = [1, "apple", True, 2.5]

#Получи элемент True из этого списка по его индексу и выведи его.

mixed = [1, "apple", True, 2.5]
print(mixed[2])
#Правильно! Задача решена верно.

#Разбор:

#Использован индекс [2] для доступа к третьему элементу списка.

#Элемент True был выведен на экран.

#Задача 16.
#Создай список fruits, содержащий три строки: "яблоко", "банан" и "апельсин".


fruits = ["яблоко", "банан", "апельсин"]
print(fruits)

#Задача 17.
#Дан список colors = ["красный", "зелёный", "синий"]. Напиши код, который выводит второй элемент этого списка.


colors = ["красный", "зелёный", "синий"]
print(colors[1])

#Задача 18.
#Дан список numbers = [1, 2, 3]. Добавь в конец списка число 4 и выведи обновлённый список.


numbers = [1, 2, 3]
numbers.append(4)
print(numbers)

#Задача 18
#Дан список `items = ["ручка", "карандаш", "ластик"]`.
#Вставь слово `"блокнот"` на вторую позицию (то есть между `"ручкой"` и `"карандашом"`) и выведи обновлённый список.


items = ["ручка", "карандаш", "ластик"]
items.insert(1, "блокнот")
print(items)

#Задача 1

#Создай список с названиями трех цветов на русском языке.

#Напиши код, который создает этот список и выводит его.

colors = ["синий", "красный", "зелёный"]
print(colors)
#Правильно! Задача решена верно.

#Разбор:

#Список создан с помощью квадратных скобок [].

#Элементы списка - строки, заключенные в кавычки.

#Список выведен на экран с помощью функции print().

#Готовы к следующей задаче по спискам? Напишите "Давай задачу".

#Давай задачу
#Задача 2

#Дан список: fruits = ["яблоко", "банан", "апельсин", "киви"]

#Используя срезы, получи из этого списка подсписок ["банан", "апельсин"].

#Напиши код, который выведет этот результат.

fruits = ["яблоко", "банан", "апельсин", "киви"]
print(fruits[1:3])
#Правильно! Задача решена верно.

#Разбор:

#Срез [1:3] взял элементы от индекса 1 до индекса 3 (не включая его).

#Результат ['банан', 'апельсин'] был выведен на экран.

#Готовы к следующей задаче? Напишите "Давай задачу".

#Давай задачу
#Задача 3

#Дан список: numbers = [1, 2, 3]

#Добавь число 4 в конец этого списка с помощью соответствующего метода.

#Напиши код, который выполняет добавление и выводит измененный список.

numbers = [1, 2, 3]
print(numbers.append(4))
#Почти! Логика верная — метод .append() действительно используется для добавления элементов в конец списка.

#Что нужно сделать:
#Метод .append() изменяет исходный список, но не возвращает новый список для печати. Поэтому, если ты попытаешься сразу напечатать результат его работы, ты получишь None.

#Нужно сначала применить метод к списку, а затем отдельной командой вывести уже измененный список.

numbers = [1, 2, 3]
numbers.append(4)
print(numbers)
#Правильно! Теперь задача решена верно.

#Разбор:

#Метод .append(4) добавил элемент в конец списка numbers.

#После изменения список имеет вид: [1, 2, 3, 4].

#Измененный список выведен на экран.

#Готовы к следующей задаче? Напишите "Давай задачу".

#Давай задачу
#Задача 4

#Дан список: items = ["a", "b", "c", "d"]

#Замени элемент "c" (с индексом 2) на "x".

#Напиши код, который выполняет замену и выводит измененный список.

items = ["a", "b", "c", "d"]
print(items[2] = "x")
#Почти! Логика замены элемента верная, но есть ошибка в синтаксисе.

#Что нужно сделать:
#Операция замены элемента списка (присваивание) и его вывод на печать — это два разных действия. Нельзя совмещать их в одной строке внутри функции print().

#Сначала выполни замену элемента, используя обращение по индексу и оператор =, а затем отдельной командой выведи измененный список.

items = ["a", "b", "c", "d"]
items[2] = "x"
print(items)
#Правильно! Теперь задача решена верно.

#Разбор:

#С помощью операции присваивания items[2] = "x" элемент с индексом 2 был заменен.

#После изменения список имеет вид: ['a', 'b', 'x', 'd'].

#Измененный список выведен на экран.

#Готовы к следующей задаче? Напишите "Давай задачу".

#Давай задачу
#Задача 5

#Дан список: animals = ["cat", "dog", "bird"]

#Добавь элемент "fish" в начало списка (на позицию с индексом 0).

#Напиши код, который выполняет добавление и выводит измененный список.

animals = ["cat", "dog", "bird"]
animals.insert (0,"fish")
print(animals)
#Правильно! Задача решена верно.

#Разбор:

#Метод .insert(0, "fish") вставил элемент "fish" на позицию с индексом 0.

#После изменения список имеет вид: ['fish', 'cat', 'dog', 'bird'].

#Измененный список выведен на экран.

#Готовы к следующей задаче? Напишите "Давай задачу".

#Давай задачу
#Задача 6

#Дан список: numbers = [5, 10, 15, 20]

#Получи первый элемент этого списка (с индексом 0) и выведи его.

numbers = [5, 10, 15, 20]
print(numbers[0])
#Правильно! Задача решена верно.

#Разбор:

#Использован индекс [0] для доступа к первому элементу списка.

#Элемент 5 был выведен на экран.

#Готовы к следующей задаче? Напишите "Давай задачу".

#Давай задачу
#Задача 7

#Даны два списка: list_a = [1, 2] и list_b = [3, 4]

#Объедини (слей) эти два списка в один с помощью оператора + и выведи результат.

list_a = [1, 2]
list_b = [3, 4]
print(list_a  + list_b)
#Правильно! Задача решена верно.

#Разбор:

#С помощью оператора + два списка объединены в один.

#Результат [1, 2, 3, 4] выведен на экран.

#Готовы к следующей задаче? Напишите "Давай задачу".

#Давай задачу
#Задача 8

#Дан список: items = ["book", "pen", "pencil"]

#Удали последний элемент из этого списка с помощью соответствующего метода.

#Напиши код, который выполняет удаление и выводит измененный список.

items = ["book", "pen", "pencil"]
items.pop()
print(items)
#Правильно! Задача решена верно.

#Разбор:

#Метод .pop() без аргументов удалил последний элемент списка.

#После изменения список имеет вид: ['book', 'pen'].

#Измененный список выведен на экран.

#Готовы к следующей задаче? Напишите "Давай задачу".

#Давай задачу
#Задача 9

#Создай пустой список с именем my_list.

#Напиши код, который создает этот список и выводит его.

my_list = []
print(my_list)
#Правильно! Задача решена верно.

#Разбор:

#Пустой список создан с помощью пустых квадратных скобок [].

#Список [] выведен на экран.

#Готовы к следующей задаче? Напишите "Давай задачу".

#Давай задачу
#Задача 10

#Дан список: data = [10, 20, 30, 40]

#Получи последний элемент этого списка, используя отрицательную индексацию.

#Напиши код, который выводит этот элемент.

data = [10, 20, 30, 40]
print(data[-1])
#Правильно! Задача решена верно.

#Разбор:

#Использована отрицательная индексация [-1] для доступа к последнему элементу списка.

#Элемент 40 был выведен на экран.

#На этом мы завершаем практику по спискам. Вы успешно закрепили все основные операции! Если в будущем захотите повторить тему списков или перейти к новой, просто обратитесь.
