#Задача 1.

#Создайте класс с именем Car. У этого класса должен быть конструктор __init__, который принимает два аргумента (после self) и сохраняет их в атрибуты объекта:

#brand (марка автомобиля)

#color (цвет автомобиля)

#После создания класса, создайте объект этого класса с аргументами "Toyota" и "красный". Сохраните объект в переменную my_car.

#Ваша задача — написать код: объявить класс с конструктором и создать объект.

class car:
    def __init__(self,brand,color):
        self.brand = brand
        self.color = color

my_car = car("Toyota","красный")

#Задача 2.

#Создайте класс с именем Book. У этого класса должен быть конструктор __init__, который принимает три аргумента (после self) и сохраняет их в атрибуты объекта:

#title (название книги)

#author (автор книги)

#pages (количество страниц)

#Добавьте метод с именем describe(), который не принимает аргументов (кроме self) и выводит на экран строку в формате:
#"Книга '[title]' автора [author] содержит [pages] страниц."

#После создания класса, создайте объект этого класса с аргументами "1984", "Джордж Оруэлл" и 328. Затем вызовите у этого объекта метод describe().

#Ваша задача — написать код: объявить класс с конструктором и методом, создать объект и вызвать его метод.

class Book:
    def __init__(self,title,author,pages):
        self.title = title
        self.author = author
        self.pages = pages
    def describe(self):
        print(f"Книга '{self.title}' автора {self.author} содержит {self.pages} страниц.")
my_book = Book("1984","Джордж Оруэлл",328)
my_book.describe()

#Задача 3.

#Создайте класс с именем Dog. У этого класса должен быть конструктор __init__, который принимает два аргумента (после self) и сохраняет их в атрибуты объекта:

#name (кличка собаки)

#breed (порода собаки)

#Добавьте метод с именем bark, который не принимает аргументов (кроме self) и выводит на экран строку: "[name] говорит: Гав!"

#После создания класса, создайте объект этого класса с аргументами "Бобик" и "дворняжка". Затем вызовите у этого объекта метод bark.

#Ваша задача — написать код: объявить класс с конструктором и методом, создать объект и вызвать его метод.

class Dog:
    def __init__(self, name, breed):
        self.name = name
        self.breed = breed
    def bark(self):
        print(f"{self.name} говорит: Гав!")

my_dog = Dog("Бобик","дворняжка")
my_dog.bark()

#Задача 4.

#Создайте класс с именем Rectangle. У этого класса должен быть конструктор __init__, который принимает два аргумента (после self) и сохраняет их в атрибуты объекта:

#height (высота прямоугольника)

#Добавьте метод с именем calculate_area, который не принимает аргументов (кроме self) и возвращает площадь прямоугольника (площадь = ширина × высота).

#После создания класса, создайте объект этого класса с аргументами 5 и 10. Затем вызовите метод calculate_area у этого объекта, сохраните результат в переменную и выведите её на экран.

#Ваша задача — написать код: объявить класс с конструктором и методом, создать объект и получить результат.

class Rectangle:
    def __init__(self, width, height):
        self.width = width
        self.height = height
    def calculate_area(self):
       return self.width * self.height

my_rectangle = Rectangle(5,10)
result = my_rectangle.calculate_area()
print(result)

#Задача 5.

#Создайте класс с именем Person. У этого класса должен быть атрибут класса (общий для всех объектов) с именем species и значением "Человек разумный".

#Конструктор __init__ должен принимать один аргумент (после self) и сохранять его в атрибут объекта:

#name (имя человека)

#После создания класса, создайте два объекта этого класса:

#Объект person1 с аргументом "Иван".

#Объект person2 с аргументом "Ольга".

#Выведите на экран значение атрибута species для каждого из созданных объектов (обращаясь через объект, например, person1.species).

#Ваша задача — написать код: объявить класс с атрибутом класса, конструктором, создать объекты и вывести общий атрибут.

class Person:
    species = "Человек разумный"
    def __init__(self,name):
        self.name = name

person1 = Person("Иван")
person2 = Person("Ольга")
print(person1.species)
print(person2.species)

#Задача 6.

#Создайте класс с именем BankAccount. У этого класса должен быть конструктор __init__, который принимает один аргумент (после self) и сохраняет его в атрибут объекта:

#balance (начальный баланс счета)

#Добавьте метод с именем deposit, который принимает один аргумент (после self) — amount (сумма пополнения) — и увеличивает баланс счета на эту сумму.

#Добавьте метод с именем get_balance, который не принимает аргументов (кроме self) и возвращает текущий баланс счета.

#После создания класса, создайте объект этого класса с начальным балансом 1000. Затем пополните счёт на 500, вызвав метод deposit. В конце вызовите метод get_balance, сохраните результат в переменную и выведите её на экран.

#Ваша задача — написать код: объявить класс с конструктором и методами, создать объект, поработать с ним и вывести итоговый баланс.

class BankAccount:
    def __init__(self, balance):
        self.balance = balance
    def deposit (self,amount):
        self.balance += amount
    def get_balance(self):
        return self.balance
my_balance = BankAccount(1000)
my_deposit = my_balance.deposit(500)
my_get_balance = my_balance.get_balance()
print(my_get_balance)

#Задача 7.

#Создайте класс с именем Circle. У этого класса должен быть конструктор __init__, который принимает один аргумент (после self) и сохраняет его в атрибут объекта:

#radius (радиус круга)

#Добавьте метод с именем calculate_circumference, который не принимает аргументов (кроме self) и возвращает длину окружности. Формула: длина_окружности = 2 * 3.14 * радиус.

#После создания класса, создайте объект этого класса с радиусом 7. Затем вызовите метод calculate_circumference, сохраните результат в переменную и выведите её на экран.

#Ваша задача — написать код: объявить класс с конструктором и методом, создать объект и получить результат.
class Circle:
    def __init__(self, radius):
        self.radius = radius
    def calculate_circumference(self):
        return 2 * 3.14 * self.radius
circle_radius = Circle(7)
result = circle_radius.calculate_circumference()
print(result)