#Задача 1.

#У вас есть список: fruits = ["яблоко", "банан", "апельсин"].
#С помощью цикла for выведите каждый элемент этого списка на экран, каждый с новой строки.

#Ваша задача — написать этот код.

fruits = ["яблоко", "банан", "апельсин"]
for fruit in fruits:
    print(fruit)

#Задача 2.

#Используя цикл while, выведите на экран числа от 1 до 5 включительно, каждое с новой строки.

#Ваша задача — написать этот код.

num = 1
while num < 6:
    print(num)
    num += 1

#Задача 3.

#Используя цикл for и функцию range(), выведите на экран все четные числа от 2 до 10 включительно, каждое с новой строки.

#Ваша задача — написать этот код.

#num = 10
#for num in range(2,11,2)
 #   print(num)
#Проверь синтаксис объявления цикла for. В конце строки с инструкцией for не хватает одного символа.

#Исправь это, и код будет работать корректно.

num = 10
for num in range(2,11,2):
    print(num)

#Задача 4.

#Дан список: numbers = [10, 20, 30, 40, 50].
#Используя цикл for, пройдитесь по списку и прервите цикл, как только встретите число 30. Выведите на экран все числа до момента прерывания (включая 30).

#Ваша задача — написать этот код.

#numbers = [10, 20, 30, 40, 50]
#for number in numbers:
#    if number == 30:
#    break
#В твоём коде есть две проблемы, которые нужно исправить:

#Тело условного оператора if должно быть с отступом.

#После оператора break ты не выводишь число на экран. В задании требуется выводить числа, включая то, при котором срабатывает прерывание.

#Доработай код, чтобы он выводил числа и корректно прерывался.

#numbers = [10, 20, 30, 40, 50]
#for number in numbers:
#    if number == 30:
#        break
#        print (number)
#Ты близок к решению, но есть логическая ошибка. Команда print(number) находится после оператора break. Это означает, что когда число станет равно 30, цикл прервется, и команда печати не выполнится.

#Перемести команду print(number) так, чтобы она выполнялась на каждой итерации цикла до момента прерывания, включая итерацию с числом 30.

numbers = [10, 20, 30, 40, 50]
for number in numbers:
    if number == 30:
        print (number)
        break
#Почти готово! Но в задании требуется вывести все числа до момента прерывания, включая 30. В твоём текущем коде вывод на экран происходит только при выполнении условия number == 30.

#Подумай, куда нужно поставить команду print(number), чтобы она выводила все числа из списка, а цикл прерывался после вывода числа 30.

numbers = [10, 20, 30, 40, 50]
for number in numbers:
    print (number)
    if number == 30:
        break

#Задача 5.

#Используя цикл for и функцию range(), выведите на экран числа от 5 до 1 в обратном порядке, каждое с новой строки.

#Ваша задача — написать этот код.

num = 1
for num in range(5,0):
    print(num)
#Подумай над аргументами для функции range(). В текущем виде цикл пытается пройти от 5 до 0 с шагом по умолчанию (1), но это не сработает, так как 0 меньше 5.

#Тебе нужно указать третий аргумент в range() — шаг. Какой шаг позволит уменьшать число на каждой итерации?

num = 1
for num in range(5,0,-1):
    print(num)

#Задача 6.

#Дан список: animals = ["кошка", "собака", "попугай", "хомяк"].
#Используя цикл for, выведите на экран только те названия животных, длина которых больше 5 символов.

#Ваша задача — написать этот код.

animals = ["кошка", "собака", "попугай", "хомяк"]
for animal in animals:
    if len(animal) > 5:
        print(animal)

#Задача 7.

#Используя цикл while, выведите на экран числа от 10 до 15 включительно, каждое с новой строки.

#Ваша задача — написать этот код.

num  = 10
while num <= 15:
    print(num)
    num +=1
#Задача 8.

#Используя цикл for и функцию range(), выведите на экран все числа от 0 до 9 включительно, каждое с новой строки.

#Ваша задача — написать этот код.

num = 10
for num in range(0,10,1):
    print(num)

#Задача 9.

#Дан список: numbers = [1, 3, 5, 7, 9, 11, 13].
#Используя цикл for, пройдитесь по списку и прервите цикл, как только встретите число больше 10. Выведите на экран все числа до момента прерывания.

#Ваша задача — написать этот код.

numbers = [1, 3, 5, 7, 9, 11, 13]
for number in numbers:
    print(number)
    if number > 10:
       break
#В твоём коде есть проблема с отступами. Тело условного оператора if (в данном случае оператор break) должно быть с отступом относительно этого if.

#Исправь отступ для оператора break, и код будет работать корректно.

numbers = [1, 3, 5, 7, 9, 11, 13]
for number in numbers:
    print(number)
    if number > 10:
        break
#Задача 10.

#Используя цикл for и функцию range(), выведите на экран все числа, кратные 3, в диапазоне от 3 до 15 включительно. Каждое число с новой строки.

#Ваша задача — написать этот код.

num = 15
for num in range(3,16,3):
    print(num)

