# Задача 1.

# Создайте новый текстовый файл с именем greeting.txt. Запишите в него одну строку: "Привет, мир!".

# Используйте контекстный менеджер with для работы с файлом.

# Ваша задача — написать этот код.

with open("greeting.txt", "w") as file:
    file.write("Привет, мир")
#Задача 2.

#Создайте новый текстовый файл с именем products.txt. Запишите в него три строки: "Хлеб", "Молоко", "Яйца". Каждый продукт должен быть на новой строке.

#Используйте контекстный менеджер with для работы с файлом.

#Ваша задача — написать этот код.

with open ("products.txt", "w") as file:
    file.write("Хлеб\n" + "Молоко\n" + "Яйца")

#Задача 3.

#Прочитайте содержимое файла greeting.txt, который был создан в первой задаче. Выведите его содержимое на экран.

#Используйте контекстный менеджер with для работы с файлом.

#Ваша задача — написать этот код.

with open ("greeting.txt", "r") as file :
    print(file)
#Ты открываешь файл для чтения, но выводишь на экран сам объект файла, а не его содержимое.

#Чтобы прочитать содержимое файла, нужно использовать один из методов чтения, например, .read().

#Исправь код внутри блока with, чтобы он считывал и выводил текст из файла.

with open ("greeting.txt", "r") as file :
    print(file.read())

#Задача 4.

#Создайте текстовый файл с именем greeting.txt и запишите в него одну строку: "Привет, мир!".

#Используйте контекстный менеджер with.

#Ваша задача — написать этот код.

with open("greeting.txt", "w") as file:
    file.write("Привет, мир!")

#Задача 5.

#Предположим, у вас уже существует файл numbers.txt, в котором записаны числа, каждое с новой строки.
#Ваша задача: прочитать этот файл и вывести его содержимое на экран.

#Используйте контекстный менеджер with.

#Ваша задача — написать этот код.

#with open("numbers.txt", "r") as file:
   # file.read()
#Ты правильно открыл файл для чтения, но есть один нюанс. Метод .read() возвращает содержимое файла как строку, однако в твоём коде это прочитанное содержимое никак не используется дальше — оно не выводится на экран.

#Чтобы увидеть содержимое файла, тебе нужно сохранить результат работы .read() в переменную и вывести её, либо сразу вывести результат.

#Исправь код, чтобы содержимое файла отобразилось на экране.

#with open("numbers.txt", "r") as file:
    #file.read()
      #  print(file)
#В твоём коде есть две проблемы:

#Отступ для print: Команда print имеет лишний отступ. В Python отступы определяют блок кода. Команда print должна быть на том же уровне отступа, что и file.read(), так как она является частью того же блока with.

#Что выводится: Ты пытаешься вывести объект file, а не прочитанное из него содержимое. Результат работы метода .read() нужно сохранить в переменную, а затем вывести эту переменную, либо вывести результат метода .read() напрямую.

#Исправь отступы и убедись, что выводишь именно прочитанный текст, а не объект файла.

with open("numbers.txt", "r") as file:
    numbers = file.read()
    print(numbers )

#Задача 6.

#Создайте файл с именем fruits.txt и запишите в него три названия фрукта, каждое с новой строки:


#яблоко
#банан
#апельсин
#Используйте контекстный менеджер with.

#Ваша задача — написать этот код.

with open("fruits.txt","w") as file:
    file.write("яблоко\nбанан\nапельсин")

#Задача 7.

#Предположим, у вас уже существует файл diary.txt. Ваша задача: добавить в конец этого файла новую строку "Сегодня отличный день!" (без перезаписи старого содержимого).

#Используйте контекстный менеджер with.

#Ваша задача — написать этот код.

#with open ("diary.txt","a") as file:
   # file.append("Сегодня отличный день!")
#Ты выбрал правильный режим открытия файла — "a" (append, добавление). Однако у объектов файла в Python нет метода .append().

#Для записи (добавления) строки в файл используется тот же метод, что и при создании файла — .write().

#Исправь название метода.

with open ("diary.txt","a") as file:
    file.write("Сегодня отличный день!")

#Задача 8.

#Предположим, у вас уже существует файл info.txt. Ваша задача: прочитать этот файл и вывести на экран только первую строку из него.

#Используйте контекстный менеджер with.

#Ваша задача — написать этот код.

with open ("info.txt","r") as file:
    first_line = file.readline()
    print(first_line)

#Задача 9.

#Создайте файл с именем my_city.txt и запишите в него две строки:

#Мой город:
#Москва
#Используйте контекстный менеджер with. Постарайтесь записать обе строки за один вызов метода .write().

#Ваша задача — написать этот код.

with open("my_city.txt","w") as file:
    file.write("Мой город:\nМосква")





