#Задача 1. (Возвращение данных из функций)

#Создайте функцию с именем square. Она должна принимать один числовой аргумент n. Функция должна возвращать квадрат этого числа (результат умножения числа на себя).

#Вызовите функцию с аргументом 4, сохраните результат в переменную и выведите его на экран.

#Ваша задача — написать этот код.

def square(n):
    return n**2
result = square(4)
print(result)

#Задача 2. (Аргументы функций)

#Создайте функцию с именем describe_pet. Она должна принимать два аргумента в строгом порядке:

#animal_type (тип животного)

#pet_name (кличка животного)

#Функция должна выводить на экран строку в формате: "У меня есть [animal_type]. Его зовут [pet_name]."

#Вызовите функцию, передав сначала "собака", а затем "Барсик".

#Ваша задача — написать этот код.

def describe_pet(animal_type, pet_name):
    print(f"У меня есть {animal_type}. Его зовут {pet_name}.")
describe_pet("собака", "Барсик")

#Задача 3. (Декораторы)

#Создайте декоратор с именем before_and_after. Он должен делать следующее:

#Перед вызовом декорируемой функции выводить на экран строку "Перед вызовом функции".

#Вызывать саму декорируемую функцию.

#После вызова декорируемой функции выводить на экран строку "После вызова функции".

#Затем примените этот декоратор к функции say_hi, которая выводит на экран строку "Привет!". Вызовите декорированную функцию.

#Ваша задача — написать этот код.

#def before_and_after(func):
#    def wrapper():
#        print("Перед вызовом функции")
#        func()
#        print("После вызова функции")
#     return wrapper

#@before_and_after
#def say_hi()
#    print("Привет!")
#say_hi()
#Проверь синтаксис объявления функции say_hi. В конце строки с def say_hi() не хватает одного символа.

#Исправь это, и код будет работать корректно.

def before_and_after(func):
    def wrapper():
        print("Перед вызовом функции")
        func()
        print("После вызова функции")
    return wrapper

@before_and_after
def say_hi():
    print("Привет!")
say_hi()

#Задача 4. (Аргументы с дефолтными значениями)

#Создайте функцию с именем make_coffee. Функция должна принимать два аргумента:

#coffee_type (обязательный) — тип кофе.

#sugar (необязательный) — количество ложек сахара, по умолчанию равное 1.

#Функция должна выводить на экран строку в формате: "Ваш [coffee_type] с [sugar] ложкой(-ами) сахара готов!".

#Вызовите функцию дважды:

#Только с аргументом coffee_type (например, "эспрессо").

#С обоими аргументами (например, "латте" и 3).

#Ваша задача — написать этот код.

def make_coffee(coffee_type,sugar=1):
    print("Ваш {coffee_type} с {sugar} ложкой(-ами) сахара готов!")
make_coffee("эспрессо")
make_coffee("латте",3)
#Проверь строку вывода в функции make_coffee. Сейчас в ней используются фигурные скобки {}, но они не превращают строку в f-строку, поэтому переменные не подставляются.

#Чтобы подставить значения переменных, нужно либо использовать f-строку, либо другой способ форматирования строк (например, метод .format()).

#Исправь строку print, чтобы значения аргументов coffee_type и sugar корректно выводились в сообщении.

def make_coffee(coffee_type,sugar=1):
    print(f"Ваш {coffee_type} с {sugar} ложкой(-ами) сахара готов!")
make_coffee("эспрессо")
make_coffee("латте",3)

#Задача 5. (Создание и вызов функций)

#Создайте функцию с именем print_list. Функция должна принимать один аргумент — список items. Её задача — выводить каждый элемент этого списка на экран, каждый с новой строки.

#После создания функции вызовите её, передав в качестве аргумента список: ["Python", "Java", "C++"].

#Ваша задача — написать этот код.

def print_list(items):
    for item in items:
        print(item)
items = ["Python", "Java", "C++"]
print_list(items)

#Задача 6. (Возвращение данных из функций / Аргументы)

#Создайте функцию с именем create_email. Она должна принимать два аргумента:

#username (обязательный) — имя пользователя.

#domain (необязательный) — домен, по умолчанию должен быть равен "company.com".

#Функция должна возвращать (не выводить!) строку электронной почты в формате: "[username]@[domain]".

#Вызовите функцию дважды и выведите результаты на экран:

#Только с аргументом username (например, "ivan").

#С обоими аргументами (например, "anna" и "gmail.com").

#Ваша задача — написать этот код.

def create_email(username,domain = "company.com"):
    return f"{username}@{domain}"
create_email("ivan")
create_email("anna","gmail.com")

#Ты забыл вывести результаты на экран. Сейчас ты вызываешь функцию, но не сохраняешь её возвращаемое значение и не печатаешь его.

#Исправь вызовы функции: сохрани результаты в переменные или сразу передай их в функцию print().

def create_email(username,domain = "company.com"):
    return f"{username}@{domain}"
print(create_email("ivan"))
print(create_email("anna","gmail.com"))

#Задача 7. (Аргументы функций)

#Создайте функцию с именем calculate. Она должна принимать три числовых аргумента в строгом порядке: a, b, operation.
#Аргумент operation — это строка, которая может быть "сумма" или "разность".

#Если operation равна "сумма", функция должна возвращать сумму a и b.

#Если operation равна "разность", функция должна возвращать разность a и b (первое минус второе).

#Если передана другая операция, функция должна возвращать None.

#Вызовите функцию два раза и выведите результаты:

#С аргументами 5, 3, "сумма".

#С аргументами 10, 4, "разность".

#Ваша задача — написать этот код.

#def calculate(a,b,operation):
#    if operation == "сумма":
#        return a + b
#    elif operation == "разность":
#        return a - b
#    else:
#        returt None
#result_1 = calculate(5, 3, "сумма")
#result_2 = calculate(10, 4, "разность")
#print(result_1)
#print(result_2)
#Проверь написание ключевого слова в блоке else. Ты написал returt вместо return.

#Исправь опечатку, и код будет работать корректно.

def calculate(a,b,operation):
    if operation == "сумма":
        return a + b
    elif operation == "разность":
        return a - b
    else:
        return None
result_1 = calculate(5, 3, "сумма")
result_2 = calculate(10, 4, "разность")
print(result_1)
print(result_2)

#Задача 8. (Создание и вызов функций / Аргументы с дефолтными значениями)

#Создайте функцию с именем show_info. Она должна принимать три аргумента:

#name (обязательный) — имя.

#age (обязательный) — возраст.

#city (необязательный) — город, по умолчанию должен быть равен "Не указан".

#Функция должна выводить на экран три строки (каждая с новой строки):
#"Имя: [name]"
#"Возраст: [age]"
#"Город: [city]"

#Вызовите функцию дважды:

#Со всеми аргументами: "Алексей", 30, "Москва".

#Только с обязательными аргументами: "Мария", 25.

#Ваша задача — написать этот код.

#def show_info (name,age,city="Не указан"):
#    print(f"Имя: {name}\nВозраст: {age}\nГород: [city}")
#show_info("Алексей", 30, "Москва")
#show_info("Мария", 25)
#Проверь закрывающую фигурную скобку в f-строке. В строке "Город: [city}" ты использовал квадратную скобку [ перед именем переменной и фигурную } после. Для f-строки нужны только фигурные скобки {}.

#Исправь [city} на {city}.

def show_info (name,age,city="Не указан"):
    print(f"Имя: {name}\nВозраст: {age}\nГород: {city}")
show_info("Алексей", 30, "Москва")
show_info("Мария", 25)


#Задача 10. (Возвращение данных из функций / Аргументы)

#Создайте функцию с именем power. Она должна принимать два числовых аргумента: base (основание) и exponent (степень). Функция должна возвращать результат возведения base в степень exponent.

#После создания функции вызовите её с аргументами 2 и 8, сохраните результат в переменную и выведите его на экран.

#Ваша задача — написать этот код.

def power(base,exponent):
    return base**exponent
result = power(2,8)
print(result)

#Задача 11.

#Создайте функцию с именем greet_user(), которая не принимает аргументов и просто выводит на экран строку: "Привет, пользователь!".

#Ваша задача — написать код: объявить функцию и затем вызвать её.

#def greet_user()
    #print("Привет, пользователь!")
#greet_user()
#Проверь синтаксис объявления функции. В конце первой строки не хватает одного символа.

#Исправь это, и код будет работать корректно.

def greet_user():
    print("Привет, пользователь!")
greet_user()
#Отлично! Задача выполнена правильно. Ты успешно объявил функцию без аргументов и вызвал её.

#Готов к следующему заданию? Напиши "Давай задание".

#Давай задание
#Задача 12.

#Создайте функцию с именем multiply_numbers(), которая принимает два аргумента (пусть они называются a и b), перемножает их и возвращает результат.

#Ваша задача — написать код: объявить функцию, затем вызвать её с числами 5 и 3, сохранить результат в переменную result и вывести эту переменную на экран.

def multiply_numbers(a,b):
    return a*b
result = multiply_numbers(5,3)
print(result)
#Правильно! Код работает корректно. Ты верно объявил функцию с двумя аргументами, использовал оператор return и корректно вызвал функцию, сохранив результат.

#Готов к следующему заданию? Напиши "Давай задание".

#Давай задание
#Задача 13.

#Создайте функцию с именем introduce(), которая принимает три аргумента: name, age и city. У аргумента city должно быть дефолтное значение "Москва".

#Функция должна выводить на экран строку в формате:
#"Меня зовут [name]. Мне [age] лет. Я живу в [city]."

#Ваша задача — написать код: объявить функцию и вызвать её два раза:

#С аргументами "Анна" и 25 (город должен принять дефолтное значение).

#С аргументами "Петр", 30 и "Казань".

def introduce(name,age,city="Москва"):
    print(f"Меня зовут {name}. Мне {age} лет. Я живу в {city}.")
introduce("Анна",25)
introduce("Петр",30,"Казань")
#Правильно! Код работает корректно. Ты верно объявил функцию с аргументом, имеющим дефолтное значение, и правильно вызвал её дважды: с использованием дефолтного значения и с его переопределением.

#Готов к следующему заданию? Напиши "Давай задание".

#Давай задание
#Задача 14.

#Создайте функцию с именем calculate_average(), которая принимает три аргумента (числа) и возвращает их среднее арифметическое.

#Среднее арифметическое вычисляется по формуле: (a + b + c) / 3.

#Ваша задача — написать код: объявить функцию, затем вызвать её с числами 10, 20 и 30, сохранить результат в переменную и вывести эту переменную на экран.

#calculate_average(a,b,c):
#    return (a + b + c) / 3
#result = calculate_average(10,20,30)
#print(result)
#Проверь синтаксис объявления функции. В начале первой строки не хватается ключевого слова.

#Добавь его, и код будет работать корректно.

def calculate_average(a,b,c):
    return (a + b + c) / 3
result = calculate_average(10,20,30)
print(result)
#Правильно! Код работает корректно. Ты верно объявил функцию с тремя аргументами, вычислил и вернул результат, а затем вывел его.

#Готов к следующему заданию? Напиши "Давай задание".

#Давай задание
#Задача 15.

#Напишите декоратор с именем my_decorator, который делает следующее:

#Перед вызовом декорированной функции выводит на экран строку: "Начало работы функции."

#Затем вызывает саму декорированную функцию.

#После вызова функции выводит на экран строку: "Завершение работы функции."

#Создайте простую функцию say_hello(), которая выводит "Привет!", и примените к ней этот декоратор.

#Ваша задача — написать код: декоратор, функцию и её вызов.

#def my_decorator(func):
#    def wrapper:
 #       print("Начало работы функции.")
  #      func()
   #     print("Завершение работы функции.")
    #return wrapper

#@my_decorator
#def say_hello():
#    print("Привет!")
#say_hello()
#Ты близок к решению. В объявлении внутренней функции wrapper не хватает круглых скобок для указания её параметров.

#Обрати внимание: функция wrapper должна быть способна принять аргументы (даже если она не использует их явно, как в этом случае), чтобы корректно передать их в декорируемую функцию func.

#Добавь скобки к wrapper, и код станет ближе к рабочему.

def my_decorator(func):
    def wrapper():
        print("Начало работы функции.")
        func()
        print("Завершение работы функции.")
    return wrapper

@my_decorator
def say_hello():
    print("Привет!")
say_hello()
#Отлично! Теперь код работает правильно. Ты верно создал декоратор, который добавляет поведение до и после вызова функции, и применил его к функции say_hello.

#Готов к следующему заданию? Напиши "Давай задание".

#Давай задание
#Задача 16.

#Создайте функцию с именем is_positive(), которая принимает один аргумент (число) и возвращает:

#True, если число больше нуля.

#False, если число меньше или равно нулю.

#Ваша задача — написать код: объявить функцию, затем вызвать её с числами 5 и -3, сохранить результаты в переменные и вывести их на экран.

def is_positive(a):
    if a>0:
        print(True)
    else:
        print(False)
result_1 = is_positive(5)
result_2 = is_positive(-3)
print(result_1)
print(result_2)
#Ты близок к решению. Обрати внимание на условие задачи: функция должна возвращать (return) True или False, а не выводить их на экран.

#Исправь тело функции: замени print на return. Тогда результат можно будет сохранить в переменные и вывести.

def is_positive(a):
    if a>0:
        return(True)
    else:
        return(False)
result_1 = is_positive(5)
result_2 = is_positive(-3)
print(result_1)
print(result_2)
#равильно! Теперь код работает корректно. Ты верно использовал оператор return для передачи результата из функции. Функция возвращает булевы значения, которые затем сохраняются и выводятся.

#На этом цикл из 6 задач по функциям завершен. Ты хорошо закрепил основные разделы темы: создание и вызов, аргументы, аргументы по умолчанию, возврат значений и декораторы.

#Если хочешь повторить еще или перейти к новой теме, просто скажи.