#Задача 1

#Используя срезы, получи из строки "Программирование" подстроку "грам".

#Напиши код, который выведет этот результат.

word_1 = "Программирование"
result = word_1[3:7]
print(result)

#Задача 2

#Напиши код, который объединит (конкатенирует) строки "Авто" и "мобиль" и выведет результат одной строкой: "Автомобиль".

#Не используй f-строки, реши задачу с помощью оператора конкатенации.

word_1 = "Авто"
word_2 = "мобиль"
result = word_1 + word_2
print(result)

#Задача 3

#Используя базовые методы строк, преобразуй строку "питон" к виду "ПИТОН".

#Напиши код, который выполнит это преобразование и выведет результат.

word_1 = "питон"
result = word1.upper()
print(result)
#Отличная работа! Логика решения абсолютно верная — метод .upper() это правильный выбор для данной задачи.

#Что нужно сделать:
#Внимательно посмотри на имя переменной во второй строке. В первой строке ты назвал её world_1, а при использовании — world1. Нужно чтобы имя переменной было одинаковым в обеих строках.

#Исправь эту небольшую опечатку, и код заработает.

word_1 = "питон"
result = word_1.upper()
print(result)

#Задача 4

#Используя f-строку, создай строку вида:
#"Меня зовут [Имя] и мне [Возраст] лет."

#Вместо [Имя] и [Возраст] подставь значения переменных name = "Анна" и age = 25.

#Напиши код, который выведет эту фразу.

name = "Анна"
age = 25
text = f"Меня зовут {name} и мне {age} лет."
print(text)

#Задача 5

#У строки "Добро пожаловать!" получи символ, который находится на позиции с индексом 6.

#Напиши код, который выведет этот один символ.

words = "Добро пожаловать!"
first_char = words[6]
print(first_char)

#Задача 6

#Напиши код, который выведет длину строки "Кодирование".

#Для этого используй встроенную функцию для получения длины.

word_1 = "Кодирование"
lenght = len(word_1)
print(lenght)
#Логика решения абсолютно верная! Функция len() — это правильный выбор для определения длины строки.

#Что нужно сделать:
#Внимательно проверь имена переменных. В третьей строке кода ты используешь имя lenght, а во второй — length. Нужно, чтобы имя переменной было написано одинаково в обеих строках.

#Исправь опечатку, и код заработает.

word_1 = "Кодирование"
lenght = len(word_1)
print(lenght)
#Отлично! Теперь код работает правильно.

#Задача 7

#Используя базовые методы строк, убери все пробелы в начале и в конце строки " Привет, мир! ".

#Напиши код, который выведет очищенную строку.

text = " Привет, мир! "
text_result = text.strip()
print(text_result)

#Задача 8

#Создай строку, которая будет содержать твой любимый афоризм или просто любую фразу, которая тебе нравится.

#Напиши код, который создает эту строку и выводит ее на экран.

my_text = "Гуси в кукурузе"
print(my_text)

#Задача 9

#Используя срезы, получи из строки "Электрификация" подстроку "триф".

#Напиши код, который выведет этот результат.

word_1 = "Электрификация"
result = word_1[4:8]
print(result)
#Почти! Срез [4:8] выведет "ктри", а нам нужна подстрока "триф".

#Что нужно сделать:
#Нужно сместить индексы среза. Посмотри внимательно на строку и определи, с какого индекса начинается буква "т" и на каком индексе заканчивается буква "ф".

word_1 = "Электрификация"
result = word_1[4:8]
print(result)
#Давай посмотрим на индексацию строки "Электрификация":

#Э - 0
#л - 1
#е - 2
#к - 3
#т - 4
#р - 5
#и - 6
#ф - 7
#и - 8
#к - 9
#а - 10
#ц - 11
#и - 12
#я - 13

#Что нужно сделать:
#Чтобы получить "триф", нужно взять символы с индекса 4 по индекс 8:

#т - 4

#р - 5

#и - 6

#ф - 7

#Правильный срез будет [4:8]. Попробуй запустить код с такими индексами.

word_1 = "Электрификация"
result = word_1[4:8]
print(result)
#Отлично! Теперь всё верно.

#Разбор:
#Срез [4:8] взял символы с индекса 4 (включительно) по индекс 8 (не включительно), что дало подстроку "триф".

#Задача 10

#Напиши код, который объединит (конкатенирует) три строки: "Python", " — " и "это сила!", и выведет результат: "Python — это сила!".

#Не используй f-строки, реши задачу с помощью оператора конкатенации.

word_1 = "Python"
word_2 = " — "
word_3 = "это сила!"
text = word_1 + word_2 + word_3
print(text)

#Задача 11

#Используя базовые методы строк, проверь, заканчивается ли строка "programming.py" на ".py".

#Напиши код, который выведет результат проверки (True или False).

website = "programming.py"
result = website.endswith(".py")
print(result)

#Задача 12

#Используя f-строку, создай строку вида:
#"Площадь прямоугольника: [результат] см²"

#Вместо [результат] подставь значение переменной area = 42.

#Напиши код, который выведет эту фразу.

area = 42
text = f"Площадь прямоугольника: {area} см²"
#Почти готово! Код написан правильно, но для завершения задачи не хватает одной важной детали.

#Что нужно сделать:
#Добавь команду вывода результата на экран, чтобы увидеть созданную строку.

area = 42
text = f"Площадь прямоугольника: {area} см²"
print(text)

#Задача 13

#У строки "Программист" получи последний символ, используя отрицательную индексацию.

#Напиши код, который выведет этот один символ.

word = "Программист"
last_char = word[-1]
print(last_char)

#Задача 14

#Напиши код, который выведет длину строки "Самообразование".

#Для этого используй встроенную функцию для получения длины.

word_1 = "Самообразование"
lenght_result = len(word_1)
print(lenght_result )

#Задача 15

#Используя базовые методы строк, замени в строке "Я люблю Java" слово "Java" на "Python".

#Напиши код, который выведет измененную строку.

text = "Я люблю Java"
change_text = text.replace("Java", "Python")
print(change_text)

#Задача 16

#Создай строку, которая будет содержать название твоего любимого фильма или книги.

#Напиши код, который создает эту строку и выводит ее на экран.

film = "Brigada"
print(film)

#Задача 17

#Используя срезы, получи из строки "Динамический" подстроку "нами".

#Напиши код, который выведет этот результат.

word_1 = "Динамический"
word_result = word_1[2:6]
print(word_result)

#Задача 18

#Напиши код, который объединит (конкатенирует) строки "Кот", "ёнок" и выведет результат одной строкой: "Котёнок".

#Не используй f-строки, реши задачу с помощью оператора конкатенации.

word_1 = "Кот"
word_2 = "ёнок"
word_result = word_1 + word_2
print(word_result)

#Задача 19

#Используя базовые методы строк, преобразуй строку "ПРОГРАММИРОВАНИЕ" к виду "программирование".

#Напиши код, который выполнит это преобразование и выведет результат.

word_1 = "ПРОГРАММИРОВАНИЕ"
word_result = word_1.lower()
print(word_result)

#Задача 20

#Используя f-строку, создай строку вида:
#"Сегодня [день недели], [число] число"

#Вместо [день недели] и [число] подставь значения переменных day = "пятница" и number = 13.

#Напиши код, который выведет эту фразу.

day = "пятница"
number = 13
text = f"Сегодня {day},{number} число"
print(text)
#Почти получилось! Синтаксис f-строки и подстановка переменных выполнены абсолютно верно.

#Что нужно сделать:
#Обрати внимание на пробелы в получившейся фразе. После запятой обычно ставится пробел для лучшей читаемости. Добавь пробел в саму f-строку после запятой, чтобы фраза выглядела естественно: "Сегодня пятница, 13 число".

day = "пятница"
number = 13
text = f"Сегодня {day}, {number} число"
print(text)

#Задача 21

#У строки "Информатика" получи первый символ, используя индекс 0.

#Напиши код, который выведет этот один символ.

word_1 = "Информатика"
result = word_1[0]
print(result)

#Задача 22

#Напиши код, который выведет длину строки "Саморазвитие".

#Для этого используй встроенную функцию для получения длины.

word_1 = "Саморазвитие"
lenght_word = len(word_1)
print(lenght_word)

