#Задача 1

#Тема: Создание словаря

#Создайте словарь student с следующими ключами и значениями:

#ключ "name" со значением "Анна"

#ключ "age" со значением 20

#ключ "grade" со значением "A"

#Выведите созданный словарь на экран.

student = {
"name" : "Анна",
"age" : 20,
"grade" : "A"
}
print(student)

#Задача 2

#Тема: Доступ к элементам словаря по ключу

#Дан словарь:

#python
#car = {"brand": "Toyota", "model": "Camry", "year": 2020}
#Напишите программу, которая выводит отдельно:

#значение по ключу "brand"

#значение по ключу "year"

#Каждое значение должно выводиться на отдельной строке.

car = {
"brand": "Toyota",
 "model": "Camry",
"year": 2020
}
print(car["brand"])
print(car["year"])

#Задача 3

#Тема: Добавление и обновление элементов словаря

#Дан словарь:

#python
#phone = {"brand": "Samsung", "model": "Galaxy"}
#Напишите программу, которая:

#Добавляет в словарь новый ключ "year" со значением 2023

#Обновляет значение ключа "model" на "Galaxy S23"

#Выводит итоговый словарь

phone = {
"brand": "Samsung",
"model": "Galaxy"}
phone["year"] = 2023
phone["model"] = "Galaxy S23"
print(phone)

#Задача 4

#Тема: Удаление элементов словаря

#Дан словарь:

#python
#book = {"title": "Преступление и наказание", "author": "Достоевский", "year": 1866, "pages": 671}
#Напишите программу, которая:

#Удаляет ключ "pages" из словаря

#Выводит итоговый словарь

book = {"title": "Преступление и наказание", "author": "Достоевский", "year": 1866, "pages": 671}
del book ["pages"]
print(book)

#Задача 5

#Тема: Получение элементов, ключей и значений словаря

#Дан словарь:

#python
#country = {"name": "Франция", "capital": "Париж", "population": 67}
#Напишите программу, которая выводит:

#Все ключи словаря

#Все значения словаря

#Все пары ключ-значение

#Каждый вывод должен быть на отдельной строке.

country = {"name": "Франция", "capital": "Париж", "population": 67}
print(country.keys())
print(country.values())
print(country)
#Почти правильно! Вы правильно использовали методы для ключей и значений, но для третьего пункта нужно вывести именно пары ключ-значение в явном виде.

#Для вывода всех пар ключ-значение используйте соответствующий метод словаря, который возвращает элементы в виде кортежей (ключ, значение).

#Исправьте третью строку вывода, используя правильный метод для получения пар ключ-значение.

country = {"name": "Франция", "capital": "Париж", "population": 67}
print(country.keys())
print(country.values())
print(country.items())

#Задача 6

#Тема: Проверка на наличие ключей и значений

#Дан словарь:

#python
#fruit = {"name": "apple", "color": "red", "weight": 150}
#Напишите программу, которая проверяет:

#Есть ли в словаре ключ "color"

#Есть ли в словаре значение "green"

#Результаты обеих проверок выведите на экран (должно получиться два значения True/False).

fruit = {"name": "apple", "color": "red", "weight": 150}
if "color" in fruit.keys():
    print(True)
else:
    print(False)
if  "green" in fruit.values():
    print(True )
else:
    print(False)
#Задача 7

#Тема: Комбинированная задача (словари + условные операторы)

#Дан словарь с информацией о продукте:

#python
#product = {"name": "Ноутбук", "price": 50000, "in_stock": True}
#Напишите программу, которая проверяет:

#Если товар есть в наличии (in_stock равен True) И цена меньше 100000, выведите "Можно купить"

#Иначе выведите "Нельзя купить"

#product = {"name": "Ноутбук", "price": 50000, "in_stock": True}
#price = product["price"]
#if in_stock = True and price < 10000:
    #print("Можно купить")
#else:
    #print("Нельзя купить")
#В коде есть несколько ошибок, которые нужно исправить:

#Доступ к значению словаря - вы не получили значение ключа "in_stock" из словаря, а используете переменную in_stock, которой не существует.

#Оператор сравнения - вы используете = (присваивание) вместо == (сравнение) в условии.

# цены - в условии указано 10000, но по условию задачи нужно 100000.

#Исправьте эти моменты, и программа будет работать правильно.

product = {"name": "Ноутбук", "price": 50000, "in_stock": True}
in_stock = product["in_stock"]
price = product["price"]
if in_stock == True and price < 100000:
    print("Можно купить")
else:
    print("Нельзя купить")

#Задача 8

#Дан словарь fruit_colors = {'apple': 'red', 'banana': 'yellow', 'grape': 'purple'}. Удали из него элемент с ключом 'grape' с помощью оператора del.

#Напиши код для решения этой задачи.

fruit_colors = {
'apple': 'red',
'banana': 'yellow',
'grape': 'purple'
}
del fruit_colors['grape']
print(fruit_colors)

#Задача 9

#Создай словарь user_info, который будет содержать три пары ключ-значение:

#имя (name) — твоё имя

#возраст (age) — твой возраст

#город (city) — твой город

#Напиши код для решения этой задачи.

#user_info = {
#"name" : "Alex"
#"age" : 29
#"city" : "Lyubertsy"
#}
#Проверь синтаксис создания словаря. В твоём коде не хватает элементов, которые разделяют перечисляемые значения внутри фигурных скобок {}.

#Допиши недостающие символы, и всё заработает.

user_info = {
"name" : "Alex",
"age" : 29,
"city" : "Lyubertsy"
}

#Задача 9

#Дан словарь book = {'title': 'Война и мир', 'author': 'Толстой'}. Выведи на экран название книги, обратившись к соответствующему ключу словаря.

#Напиши код для решения этой задачи.

book = {
'title': 'Война и мир',
'author': 'Толстой'}
print(book["title"])

#Задача 10

#У нас есть словарь car = {'brand': 'Toyota'}.

#Добавь в него модель автомобиля (ключ 'model') со значением 'Camry'.

#Затем обнови значение ключа 'brand' на 'Lexus'.

#Напиши код для решения этой задачи.

car = {'brand': 'Toyota'}
car["model"] = "Camry"
car["brand"] = "Lexus"
print(car)

#Задача 11

#Дан словарь pc = {'cpu': 'Intel', 'gpu': 'Nvidia', 'ram': '16GB'}. Выведи на экран список всех его ключей, используя соответствующий метод словаря.

#Напиши код для решения этой задачи.

pc = {
'cpu': 'Intel',
'gpu': 'Nvidia',
'ram': '16GB'
}
print(pc.keys())

#Задача 12

#Дан словарь inventory = {'apples': 5, 'bananas': 2, 'oranges': 0}. Проверь, есть ли в словаре ключ 'oranges', используя специальный оператор для проверки принадлежности (in). Результат проверки (True или False) выведи на экран.

#Напиши код для решения этой задачи.

inventory = {
'apples': 5,
'bananas': 2,
'oranges': 0
}
assert "oranges" in inventory
#Проверь оператор, который ты использовал для вывода результата на экран. assert — это оператор для отладки, который проверяет истинность условия, но он не выводит результат True или False на экран, как требуется в задаче.

#Вместо этого используй функцию для печати, внутри которой будет проверка на вхождение ключа с помощью оператора in.

inventory = {
'apples': 5,
'bananas': 2,
'oranges': 0
}
if "oranges" in inventory:
    print(True)
else:
    print(False)

