#Задача 1.
#Напишите программу, которая объявляет переменную с именем count и присваивает ей значение 10. Затем выведите значение этой переменной на экран.

count = 10
print(count)

#Задача 2.
#Напишите программу, которая выполняет следующие действия:
#Объявляет переменную my_number и присваивает ей значение 5.
#Переопределяет эту переменную, присваивая ей значение 12.
#Выводит новое значение переменной на экран.

my_number = 5
my_number = 12
print(my_number)

#Задача 3.
#Напишите программу, которая объявляет две переменные: a и b.
#Присвойте им значения 15 и 4 соответственно.
#Выведите на экран результат их сложения и результат их умножения, каждый с новой строки.

a = 15
b = 4
c = a + b
d = a * b
print (c)
print (d)

#Задача 4.
#Напишите программу, которая запрашивает у пользователя его имя с помощью функции input() и сохраняет результат в переменную user_name. Затем выведите на экран сообщение: "Привет, [user_name]!" (где [user_name] должно быть заменено на введенное имя).
#Подсказка: не забудьте, что input() возвращает строку.
user_name = input()
print ("Привет," user_name)
#Почти все правильно! В коде есть небольшая синтаксическая ошибка.
#Что нужно доработать:
#В функции print() не хватает символа между текстом "Привет," и переменной user_name. Их нужно правильно объединить.
#Попробуйте исправить эту строку и запустите программу снова.
user_name = input()
print ("Привет,", user_name)

#Задача 5.
# Напишите программу, которая:Создает переменную x со значением 8 и переменную y со значением 3.
# Проверяет, является ли x больше y.
#Выводит на экран результат этого сравнения (True или False).
x = 8
y = 3
if x > y:
# В коде не хватает завершающего действия.Что нужно доработать:Для вывода результата сравнения не требуется конструкция if.
# Само сравнение x > y уже возвращает True или False.
# Вам нужно просто вывести результат этого сравнения на экран с помощью функции print().
#Исправьте последнюю строку.
x = 8
y = 3
print(x>y)

#Задача 6.
# У вас есть две переменные:
num_str = "50" #(это строка)
num_int = 10 #(это целое число)
#Преобразуйте строку num_str в целое число, сложите его с num_int и выведите результат на экран.
num_str = "50"
num_int = 10
num_int2 = int(num_str)
total = num_int + num_int2
print(total)

#Задача 7.
#Напишите программу, которая объявляет переменную с именем user_age и присваивает ей целое число 25. Убедитесь, что имя переменной соответствует правилам именования в Python. Выведите значение переменной на экран.
user_age = 25
print(user_age)

#Задача 8.

#Напишите программу, которая создает три переменные:
#Первая должна содержать целое число.
#Вторая должна содержать дробное число.
#Третья должна содержать строку.
#Выведите на экран тип данных каждой из этих переменных, каждый с новой строки, используя функцию type().
number_1 = 71
number_2 = 5.1871
string = "Labubu"
print(type(number_1 ))
print(type(number_2))
print(type(string))

#Задача 9.
#Напишите программу, которая:
#Создает переменную is_active и присваивает ей логическое значение False.
#Создает переменную score и присваивает ей целое число 0.
#Выводит на экран тип данных каждой из этих переменных, каждый с новой строки.

is_active = False
score = 0
print(type(is_active))
print(type(score))

#Задача 10

#Создайте переменную с названием number и присвойте ей значение 15.

#(Раздел: Объявление переменных)

number = 15
print(number)

#Задача 11

#У вас есть переменная age = "25". Преобразуйте ее в числовой тип и прибавьте 5.

#(Раздел: Преобразование типов данных)

age = "25"
int_age = int(age)
total = int_age + 5
print(total)


#Задача 12

#Напишите код, который сравнивает два числа из переменных x и y и проверяет, является ли x больше или равным y. Результат проверки должен быть сохранен в переменную result.

#(Раздел: Операции сравнения)

x = 15
y = 14
result = x >= y
print(result)

#Задача 13

#Создайте три переменные: одна должна хранить целое число, вторая — дробное число, а третья — строку с вашим именем.

#(Раздел: Типы данных)

int = 47
float = 3.14
str = "Aleksei"
#Код работает, но в нём есть критическая проблема с именованием переменных.

#Вы использовали в качестве имён переменных зарезервированные слова Python: int, float и str. Этого делать нельзя, так как эти слова являются названиями встроенных типов данных и функций. Их переопределение приведёт к ошибкам в дальнейшем коде.

#Что нужно доработать:
#Измените названия переменных так, чтобы они не совпадали со встроенными ключевыми словами Python.

#Исправьте это, и задача будет решена верно.

int_1 = 47
float_2 = 3.14
str_3 = "Aleksei"

#Задача 14

#Вычислите остаток от деления 17 на 5 и сохраните его в переменную remainder.

#(Раздел: Арифметические операции)

number_1 = 17
number_2 = 5
remainder = number_1 % number_2
print(remainder)

#Задача 15

#Какое из этих имен переменных является неправильным в Python и почему?
#my_var, 2nd_name, total_sum, class

#(Раздел: Именование переменных)

#2nd_name - так как начинается с числа

#Задача 16

#Даны две строки: str1 = "apple" и str2 = "banana". Сравните их на равенство и результат запишите в переменную is_equal.

#(Раздел: Операции сравнения)

str1 = "apple"
str2 = "banana"
is_equal = str1 == str2
print(is_equal)


#Задача 17

#Определите тип данных результата выражения 10 / 2.

#(Раздел: Классификация по типам данных)

num_1 = 10
num_2 = 2
score = num_1 / num_2
print(type(score))

#Задача 18

#Создайте переменную message со значением "Привет". Затем измените ее значение на "Пока".

#(Раздел: Переопределение переменной)

message = "Привет"
message = "Пока"
print(message )

#Задача 19

#Напишите код, который вычисляет площадь прямоугольника. Длины сторон (целые числа) задайте в переменных a и b. Результат сохраните в переменную area.

#(Раздел: Арифметические операции)

a = 7
b = 9
area = a * b
print(area)

#Задача 20

#Объявите переменную price со строковым значением "150.5". Преобразуйте ее в тип float и сохраните в новую переменную numeric_price.

#(Раздел: Преобразование типов данных)

price = "150.5"
numeric_price = float(price)
print(numeric_price )

#Задача 21

#Каким будет тип данных у переменной result после выполнения кода result = 5 != 3?

#(Раздел: Типы данных)

result = 5 != 3
print(type(result))